const __err_infos={
'0':"成功",
'1':"不建议使用",
'100':"系统内部错误",
'101':"网络请求失败",
'102':"请求令牌失效",
'103':"请求为空",
'104':"数据库异常",
'105':"会话异常或未登录",
'106':"服务不存在",
'107':"系统繁忙",
'108':"请求超时",
'109':"不支持所需的功能",
'110':"请求的功能不存在",
'111':"没有相应的权限或未登录，不能执行此操作",
'112':"找不到可以使用的服务节点",
'113':"请求了不合适的节点",
'114':"第三方服务错误",
'115':"余额不足",
'118':'禁止访问',
'150':"未知错误",
'2000':"数据已存在",
'2001':"数据不存在",
'3000':"接口错误",
'3001':"请求消息体错误",
'3002':"版本不匹配",
'3003':"数据状态不正确",
'4000':"请求参数错误",
'5000':"服务异常",
'5001':"服务状态异常",
'100000':"客户端处理失败",
'unknown':"未知错误"
};

//toString().padStart(2,'0')要慢30%
function date2str(dt) { //yyyy/MM/dd
  return dt.getFullYear()
   + '/' + ((v=dt.getMonth()+1)>9?v:'0'+v)
   + '/' + ((v=dt.getDate())>9?v:'0'+v);
}

function datetime2str(dt,withSec) { //yyyy/MM/dd HH:mm
  var v;
  var s=dt.getFullYear()
   + '/' + ((v=dt.getMonth()+1)>9?v:'0'+v)
   + '/' + ((v=dt.getDate())>9?v:'0'+v)
   + ' ' + ((v=dt.getHours())>9?v:'0'+v)
   + ':' + ((v=dt.getMinutes())>9?v:'0'+v);
   if(withSec) {
     s+=':'+((v=dt.getSeconds())>9?v:'0'+v);
   }
   return s;
}
